<a href="https://colab.research.google.com/github/Rohit-Thakre/Machine-Learning-/blob/main/Code/Pandas/4Preprocessing_filling_values_methods.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# in this file i'm dealing with both categorical and numerical variables

##categorical variable types: 

1.ordinal(kind of orders, i.e Grades)

2.nominal(just a variables)





##numerical variable types: 
1. Continuous (float type i guess i.e 49.5)
2. Discrete (whole no i.e 49)

In [2]:
# importing library 
import pandas as pd 
import numpy as np
from sklearn.impute import SimpleImputer

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [24]:
# loading dataframes
df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/jupyter/Dataset /Bengaluru_House_Data.csv", nrows = 500)

In [25]:
df.head()

              area_type   availability  ... balcony   price
0  Super built-up  Area         19-Dec  ...     1.0   39.07
1            Plot  Area  Ready To Move  ...     3.0  120.00
2        Built-up  Area  Ready To Move  ...     3.0   62.00
3  Super built-up  Area  Ready To Move  ...     1.0   95.00
4  Super built-up  Area  Ready To Move  ...     1.0   51.00

[5 rows x 9 columns]

In [26]:
df.shape

(500, 9)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     500 non-null    object
 1   availability  500 non-null    object
 2   location      500 non-null    object
 3   size          500 non-null    object
 4   society       320 non-null    object
 5   total_sqft    500 non-null    object
 6   bath          496 non-null    float64
 7   balcony       478 non-null    float64
 8   price         500 non-null    float64
dtypes: float64(3), object(6)
memory usage: 35.3+ KB

In [28]:
# viewing % of missing values
df.isnull().sum()/df.shape[0] * 100

area_type        0.0
availability     0.0
location         0.0
size             0.0
society         36.0
total_sqft       0.0
bath             0.8
balcony          4.4
price            0.0
dtype: float64

In [29]:
df.isnull().sum()

area_type         0
availability      0
location          0
size              0
society         180
total_sqft        0
bath              4
balcony          22
price             0
dtype: int64

In [30]:
#  this col has large no. of missing values that's why droping it from dataset
df.drop("society", axis = 1, inplace= True)

In [31]:
# viewing  sum of null rows in bath col
df["bath"].isnull().sum()

4

#.mode()
here bath is object data type hence i'm using mode() method for filling missing 
values

In [32]:
df["bath"].update(df[df["bath"].isnull()].any(axis = 1).fillna(df["bath"].mode()))

In [33]:
df["bath"].isnull().sum()

0

In [34]:
df["balcony"].isnull().sum()

22

In [35]:
# ṣelecting only these rows of balcony col which are null i.e NaN
df[df["balcony"].isnull()].any(axis = 1)

6      True
7      True
9      True
34     True
40     True
45     True
56     True
81     True
140    True
146    True
149    True
153    True
192    True
224    True
258    True
344    True
381    True
397    True
411    True
434    True
435    True
477    True
dtype: bool

In [36]:
# assigned index of null rows of balcony column to ind (i.e index ) for future process
ind = df[df["balcony"].isnull()].any(axis = 1).index
ind

Int64Index([  6,   7,   9,  34,  40,  45,  56,  81, 140, 146, 149, 153, 192,
            224, 258, 344, 381, 397, 411, 434, 435, 477],
           dtype='int64')

In [37]:
# viewing only these rows which is null in balcony col
size_lst = df.loc[ind, 'size'].unique()
df.loc[ind, 'size']

6          4 BHK
7          4 BHK
9      6 Bedroom
34         3 BHK
40         2 BHK
45     8 Bedroom
56     4 Bedroom
81     4 Bedroom
140    8 Bedroom
146        3 BHK
149    6 Bedroom
153        3 BHK
192    4 Bedroom
224        3 BHK
258    5 Bedroom
344        1 BHK
381        2 BHK
397        6 BHK
411        2 BHK
434    8 Bedroom
435        3 BHK
477        4 BHK
Name: size, dtype: object

In [38]:
size_lst

array(['4 BHK', '6 Bedroom', '3 BHK', '2 BHK', '8 Bedroom', '4 Bedroom',
       '5 Bedroom', '1 BHK', '6 BHK'], dtype=object)

In [39]:
# selecting the balcony rows which has size of '4 BHK' for next procedure 
df[df.loc[:, 'size'] == '4 BHK']['balcony']

6      NaN
7      NaN
30     0.0
122    0.0
123    2.0
210    1.0
222    1.0
298    0.0
300    2.0
308    3.0
337    2.0
358    3.0
370    2.0
401    1.0
403    1.0
472    1.0
477    NaN
480    2.0
485    3.0
Name: balcony, dtype: float64

In [40]:
# taking mean() of balcony rows which has size of '4BHK'
df[df.loc[:, 'size'] == '4 BHK']['balcony'].mean()

1.5

# filling values by class 
by class's mean, it also could be median

In [41]:
df.update(df[df.loc[:, 'size'] == '4 BHK']["balcony"].replace(np.nan,df[df.loc[:, 'size'] == '4 BHK']['balcony'].mean() ))
# here .replace() method's inplce = True is not working, that's why used .update() method

In [42]:
# checking whether changes are done or not
# df[df["balcony"].isnull()].any(axis = 1)
df.loc[[6,7], 'balcony']

6    1.5
7    1.5
Name: balcony, dtype: float64

In [43]:
for x in size_lst: 
  df.update(df[df.loc[:, 'size'] == x]["balcony"].replace(np.nan,df[df.loc[:, 'size'] == x]['balcony'].mean() ))

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     500 non-null    object
 1   availability  500 non-null    object
 2   location      500 non-null    object
 3   size          500 non-null    object
 4   total_sqft    500 non-null    object
 5   bath          500 non-null    object
 6   balcony       500 non-null    float64
 7   price         500 non-null    float64
dtypes: float64(2), object(6)
memory usage: 31.4+ KB

#filling null Float64 data type using mean() method 
mean() is kind of average, which sums all values and divide it by no. of values

In [46]:
df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/jupyter/Dataset /Bengaluru_House_Data.csv", nrows = 1000)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     1000 non-null   object
 1   availability  1000 non-null   object
 2   location      999 non-null    object
 3   size          999 non-null    object
 4   society       605 non-null    object
 5   total_sqft    1000 non-null   object
 6   bath          991 non-null    float64
 7   balcony       951 non-null    float64
 8   price         1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

In [48]:
df["balcony"].isnull().sum()

49

In [49]:
df['balcony'].fillna(df['balcony'].mean(), inplace = True)

In [50]:
df.isnull().sum()

area_type         0
availability      0
location          1
size              1
society         395
total_sqft        0
bath              9
balcony           0
price             0
dtype: int64

#filling null Float64 data type using median() method 
median() method  takes middle value of given series

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     1000 non-null   object
 1   availability  1000 non-null   object
 2   location      999 non-null    object
 3   size          999 non-null    object
 4   society       605 non-null    object
 5   total_sqft    1000 non-null   object
 6   bath          991 non-null    float64
 7   balcony       1000 non-null   float64
 8   price         1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

In [52]:
df["bath"].isnull().sum()

9

In [53]:
df['bath'].fillna(df['bath'].median(), inplace = True)

In [54]:
df['bath'].isnull().sum()

0

#mode() method for filling categorical variables
mode() method takes the values as mode values which appeared most in the given series

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     1000 non-null   object
 1   availability  1000 non-null   object
 2   location      999 non-null    object
 3   size          999 non-null    object
 4   society       605 non-null    object
 5   total_sqft    1000 non-null   object
 6   bath          1000 non-null   float64
 7   balcony       1000 non-null   float64
 8   price         1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

In [56]:
# here location col has null values and i'm filling it by mode() method, for location this operation should not be done, but still i'm doing this 
# for testing my skills

In [57]:
df['location'].isnull().sum()

1

In [58]:
df['location'].value_counts()

Whitefield              39
Electronic City         31
Sarjapur  Road          23
Kanakpura Road          20
Marathahalli            19
                        ..
Maragondanahalli         1
sapthagiri Layout        1
Ring Road Nagarbhavi     1
HBR Layout               1
Coffee Board Layout      1
Name: location, Length: 392, dtype: int64

In [62]:
df['location'].mode()

0    Whitefield
dtype: object

In [59]:
df['location'].fillna('Whitefield  ', inplace= True)

In [60]:
df['location'].isnull().sum()

0

# filling null values by scikit learn library 
from sklearn.impute import SimpleImputer

again filling filled null values

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     1000 non-null   object
 1   availability  1000 non-null   object
 2   location      1000 non-null   object
 3   size          999 non-null    object
 4   society       605 non-null    object
 5   total_sqft    1000 non-null   object
 6   bath          1000 non-null   float64
 7   balcony       1000 non-null   float64
 8   price         1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

In [64]:
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')

In [65]:
num_cols = df.select_dtypes(include=['int64', 'float64']).columns
num_cols

Index(['bath', 'balcony', 'price'], dtype='object')

In [66]:
imputer_ar= imputer.fit_transform(df[num_cols])

In [67]:
imputer_ar

array([[  2.  ,   1.  ,  39.07],
       [  5.  ,   3.  , 120.  ],
       [  2.  ,   3.  ,  62.  ],
       ...,
       [  3.  ,   1.  ,  56.12],
       [  2.  ,   2.  ,  67.  ],
       [  4.  ,   2.  , 145.  ]])

In [68]:
imputed_df_num = pd.DataFrame(imputer_ar, columns = num_cols)

In [69]:
imputed_df_num

     bath  balcony   price
0     2.0      1.0   39.07
1     5.0      3.0  120.00
2     2.0      3.0   62.00
3     3.0      1.0   95.00
4     2.0      1.0   51.00
..    ...      ...     ...
995   2.0      2.0   80.00
996   1.0      0.0   20.00
997   3.0      1.0   56.12
998   2.0      2.0   67.00
999   4.0      2.0  145.00

[1000 rows x 3 columns]

In [70]:
# making changes in origional dataset
df[num_cols] = imputed_df_num

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     1000 non-null   object
 1   availability  1000 non-null   object
 2   location      1000 non-null   object
 3   size          999 non-null    object
 4   society       605 non-null    object
 5   total_sqft    1000 non-null   object
 6   bath          1000 non-null   float64
 7   balcony       1000 non-null   float64
 8   price         1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB

In [72]:
# now filling object cols

In [73]:
imputer2 = SimpleImputer(missing_values=np.nan, strategy='most_frequent')

In [74]:
obj_cols =df.select_dtypes(include='object').columns

In [75]:
obj_cols

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft'],
      dtype='object')

In [76]:
obj_ar = imputer2.fit_transform(df[obj_cols])

In [77]:
obj_ar_df = pd.DataFrame(data  = obj_ar, columns = obj_cols)

In [78]:
obj_ar_df.head()

              area_type   availability  ...  society total_sqft
0  Super built-up  Area         19-Dec  ...  Coomee        1056
1            Plot  Area  Ready To Move  ...  Theanmp       2600
2        Built-up  Area  Ready To Move  ...  GrrvaGr       1440
3  Super built-up  Area  Ready To Move  ...  Soiewre       1521
4  Super built-up  Area  Ready To Move  ...  GrrvaGr       1200

[5 rows x 6 columns]

In [79]:
# making change in origional dataframe
df[obj_cols] = obj_ar_df

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     1000 non-null   object
 1   availability  1000 non-null   object
 2   location      1000 non-null   object
 3   size          1000 non-null   object
 4   society       1000 non-null   object
 5   total_sqft    1000 non-null   object
 6   bath          1000 non-null   float64
 7   balcony       1000 non-null   float64
 8   price         1000 non-null   float64
dtypes: float64(3), object(6)
memory usage: 70.4+ KB